{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "openai/whisper-small",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.19.1",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "decoder.layers.1.self_attn.q_proj",
    "decoder.layers.3.self_attn.v_proj",
    "decoder.layers.8.self_attn.q_proj",
    "decoder.layers.10.self_attn.q_proj",
    "encoder_attn.v_proj",
    "decoder.layers.2.self_attn.q_proj",
    "decoder.layers.2.self_attn.v_proj",
    "decoder.layers.5.self_attn.q_proj",
    "decoder.layers.11.self_attn.q_proj",
    "decoder.layers.3.self_attn.q_proj",
    "decoder.layers.8.self_attn.v_proj",
    "decoder.layers.7.self_attn.v_proj",
    "encoder_attn.q_proj",
    "decoder.layers.6.self_attn.q_proj",
    "decoder.layers.1.self_attn.v_proj",
    "decoder.layers.0.self_attn.q_proj",
    "decoder.layers.5.self_attn.v_proj",
    "decoder.layers.6.self_attn.v_proj",
    "decoder.layers.9.self_attn.q_proj",
    "decoder.layers.4.self_attn.q_proj",
    "decoder.layers.11.self_attn.v_proj",
    "decoder.layers.7.self_attn.q_proj",
    "decoder.layers.9.self_attn.v_proj",
    "decoder.layers.4.self_attn.v_proj",
    "decoder.layers.0.self_attn.v_proj",
    "decoder.layers.10.self_attn.v_proj"
  ],
  "target_parameters": null,
  "task_type": "SEQ_2_SEQ_LM",
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}